# Властелин Чисел: Братство общей цифры
# Во времена магии и драконов существовало мнение,
# что числа обладают великой силой, способной изменить мир.
#
# Всё началось с написания великих чисел.
# Три числа были переданы эльфам. Семь — отданы повелителям гномов. А девять... были переданы человеческому роду.
#
# Но все они оказались обмануты,
# потому что существовало ещё одно число.
# В стране Нумия на бумаге из тёмного папируса властелин Зерон тайно написал Единую Цифру,
# подчиняющую себе все великие числа.
#
# Давайте выясним, что это за цифра.
#
# Формат ввода
# В первой строке записано двузначное число одного из эльфов.
# Во второй строке — Гномов.
# В третьей — Людей.
#
# Формат вывода
# Одна цифра — общая у всех трёх чисел в одинаковой позиции


def check_numbers(a, b, c):
    if a // 10 == b // 10 == c // 10:
        return a // 10

    return a % 10


if __name__ == '__main__':
    a = int(input())
    b = int(input())
    c = int(input())

    print(check_numbers(a, b, c))